# NearDistance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CameraInfo..::..NearDistance Property
CameraInfo Class See Also
---
Distance from eye point to near plane of view frustum along the view direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double NearDistance { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NearDistance As Double
	Get
```

Visual C++
---
```text
public:
property double NearDistance {
	double get ();
}
```

# Remarks
This property together with FarDistance determines the depth restrictions of a view frustum.
# See Also
CameraInfo Class
Autodesk.Revit.DB Namespace